<template>
  <div class="container">
    <div class="login">
      <div class="head">
        <img src="../../assets/images/logo.svg" alt="">
        <div class="title">
          <p>粉丝管理平台</p>
          <span>fan.evtape.com</span>
        </div>
      </div>
      <form id="myForm">
         <div class="item">
            <span class="icon-user"></span>
            <input type="text" placeholder="填写2-12个字的中英文昵称" name="username" v-model="username">
         </div>
         <div class="item">
            <span class="icon-phone"></span>
            <input type="text" placeholder="填写11位手机号码" name="phone" v-model="phone">
         </div>
         <div class="code">
            <div class="item">
               <span class="icon-verification"></span>
               <input type="text" placeholder="输入短信收到的验证码" name="verification" v-model="verification">
            </div>
            <button class="button" type="button" :disabled="disabled" @click="getVerificationCode">{{btnStr}}</button>
         </div>
         <div class="item">
            <span class="icon-inviter"></span>
            <input type="text" placeholder="请填写邀请人的名字" name="inviter" v-model="inviter">
         </div>
         <p class="item">
            <label class="checkbox">
               <input type="checkbox" name="" id="" v-model="checked">
               <i></i>
            </label>
            <em>查看并同意 <i @click="agreementModal = true">注册协议</i></em>
         </p>
         <button class="button" type="button" @click="doRegist" style="margin-top: 0;">注册并等待审核</button>
         <p>审核完成后会发送短信通知，请注意查看</p>
         <p>已有账号，<router-link tag="a" :to="{name: 'login'}">返回登录</router-link></p>
      </form>
    </div>
    <!-- 注册协议 -->
    <Modal
         v-model="agreementModal"
         title="魔粉平台注册协议"
         width="800"
         footer-hide
      >
         <div class="aggreement">
            <div class="inner">
               <h3>前言:</h3>
               <p>在使用北京魔带互联科技有限公司的魔粉网站（以下简称“魔粉”）fan.evtape.com产品和服务前，请您务必仔细阅读并透彻理解本声明。一旦您选择使用，即表示您认可并接受本条款现有内容及可能更新的内容。</p>
               <h3>一、协议范围</h3>
               <p>1.1 魔粉网站服务条款是您与北京魔粉互联科技有限公司就使用魔粉网站服务（包含为您提供网站页面信息浏览、账户注册服务等）而订立的有效合约。</p>
               <p>1.2 魔粉网站包含域名为fan.evtape.com的网站及其下属页面。</p>
               <p>1.3 如您使用或购买魔粉网站上某一具体服务，您仍需确认具体服务对价格及服务内容；请您审慎阅读、充分理解各条款内容，选择接受或不接受该服务。</p>
               <h3>二、账户注册与使用</h3>
               <p>2.1注册资格</p>
               <p>2.1.1 您确认，在您开始使用/注册程序使用魔粉服务前，您应当具备中华人民共和国法律规定的与您行为相适应的民事行为能力。若您不具备前述与您行为相适应的民事行为能力，则您及您的监护人应依照法律规定承担因此而导致的一切后果。</p>
               <p>2.1.2 您还需确保您不是任何国家、国际组织或者地域实施的贸易限制、制裁或其他法律、规则限制的对象，否则您可能无法正常注册及使用魔粉服务。</p>
               <p>2.2 账户注册</p>
               <p>2.2.1 当您按照注册页面提示填写信息、阅读并同意本服务条款且完成全部注册程序后，您可获得魔粉账户并成为魔粉的用户。</p>
               <p>2.2.2您在注册时候设置或确认的账户名（“账户名称”），将在注册成功后成为您的账户。</p>
               <p>2.2.3 您设置的账户名不得违反国家法律法规，否则您的账户可能不能注册成功或魔粉有权经通知您后予以注销。</p>
               <p>2.2.4 您应当按照法律法规要求或按相应页面的提示，准确提供并及时更新您的账户信息，以使之真实、及时、完整和准确。如您提供的资料错误、不实、过时或不完整的，魔粉可以向您发出询问及/或要求改正的通知，您应按照魔粉的要求配合提供或者更新相关资料。因您填写的信息、资料不真实、不及时、不完整或不准确的，您应承担您不能使用魔粉账户（不能注册成功、或账户被冻结、注销）或您在使用过程中的后果和损失。</p>
               <p>2.2.5 魔粉可能会就某些产品或服务的开通，要求您提供更多的身份资料和信息，做进一步的身份认证或资格验证，您的账户只有在通过这些认证和验证之后，方可获得使用相关产品或服务的资格。</p>
               <p>2.3. 账户的使用和安全</p>
               <p>2.3.1 您有权使用您设定的账户登录魔粉网站，进而使用魔粉提供的其他服务。</p>
               <p>2.3.2 魔粉网站可能会以邮件、站内信、短信或电话等方式通知您服务进展情况以及提示您进行下一步的操作。在服务过程中您应当及时登录到魔粉账户查看和进行交易操作。</p>
               <p>2.3.3 一个魔粉账户仅能对应唯一的法律主体。除非有法律明文规定、司法裁定或者经魔粉同意的情况下，您不得以任何方式转让、赠与或让他人继承您的魔粉账户。</p>
               <p>2.3.4 您的账户和密码由您自行设置并由您保管，您须对您的魔粉账户保密。</p>
               <p>2.3.6 魔粉亦会在网站服务端采取合理的技术措施保障账户的安全。</p>
               <p>2.4 更新维护</p>
               <p>您应当及时更新您提供的信息（包括但不限于注册资料等），确保符合及时、详尽、真实、准确的要求。在法律有明确规定要求魔粉对部分用户的信息进行核实的情况下，魔粉将依法不时地对您的信息进行检查核实，您应当配合提供最新、真实、完整的信息。您在更改、删除有关信息的同时也可能会造成储存在系统中的文字、图片、视频等丢失，魔粉对您自主操作导致内容丢失不承担责任。</p>
               
               <h3>三、网站服务与规范</h3>
               <p>3.1 魔粉网站服务</p>
               <p>您有权享受本网站提供的互联网技术服务和信息服务。您同时还应根据本服务条款以及您在购买具体服务时确认的相关条款和条件，履行及时付款、服务管理等责任。</p>
               <p>3.2 禁止的内容</p>
               <p>您使用魔粉服务时将遵从国家、地方法律法规、行业惯例和社会公共道德，不会利用魔粉提供的服务进行存储、发布、传播如下信息和内容：</p>
               <p>a. 违反国家法律法规政策的任何内容（信息）；</p>
               <p>b. 违反国家规定的政治宣传和/或新闻信息；</p>
               <p>c. 涉及国家秘密和/或安全的信息；</p>
               <p>d. 封建迷信和/或淫秽、色情、下流的信息或教唆犯罪的信息；</p>
               <p>e. 博彩有奖、赌博游戏；违反国家民族和宗教政策的信息；</p>
               <p>f. 妨碍互联网运行安全的信息；</p>
               <p>g. 侵害他人合法权益的信息和/或其他有损于社会秩序、社会治安、公共道德的信息或内容；</p>
               <p>h. 您同时承诺不得为他人发布上述不符合国家规定和/或本服务条款约定的信息内容提供任何便利，包括但不限于设置URL、BANNER链接等；</p>
               <p>i. 不应出现任何破坏或试图破坏网络安全等的行为，包括不会利用技术或其他手段破坏或扰乱本网站及魔粉其他客户的网站；</p>
               <p>如您违反上述保证，魔粉有权根据相关服务条款采取删除信息、中止服务、终止服务的措施，并有权冻结或注销您账户部分或全部功能。</p>
               <p>如果您上传、发布或传输的内容含有以上违反法律法规的信息或内容的，或者侵犯任何第三方的合法权益，您将直接承担以上导致的一切不利后果。</p>
               
               <h3>四、隐私权政策</h3>
               <p>4.1 保密</p>
               <p>魔粉承诺对您注册账户时或使用魔粉服务时提交或知悉的信息采取保密措施，不向第三方披露您的信息，除非：</p>
               <p>a. 依据本服务条款或者您与魔粉之间其他服务协议、合同、在线条款等规定可以提供的；</p>
               <p>b. 依据法律法规的规定或行政、司法等职权部门要求应当提供的；</p>
               <p>c. 在不违反本服务条款约定责任的前提下，该保密信息已经公开或能从公开领域获得。</p>
               <p>4.2 魔粉如何使用信息</p>
               <p>因收集您的信息是为了向您提供服务及提升服务质量的目的，为了实现这一目的，魔粉会把您的信息用于下列用途：</p>
               <p>a. 向您提供您使用的各项服务，并设计、维护、改进这些服务；</p>
               <p>b. 向您推荐您可能感兴趣的内容，包括但不限于向您发出产品和服务信息，或通过系统向您展示个性化的第三方推广信息，或者在征得您同意的情况下与魔粉的合作伙伴共享信息以便他们向您发送有关其产品和服务的信息；</p>
               <p>c. 向您提供与您更加相关的广告以替代普遍投放的广告；</p>
               <p>d. 魔粉可能使用您的个人信息以预防、发现、调查欺诈、危害安全、非法或违反与魔粉或其关联方协议、政策或规则的行为，以保护您、其他魔粉用户，或魔粉或其关联方的合法权益；</p>
               <p>e. 魔粉可能会将来自某项服务的个人信息与来自其他服务的信息结合起来，用于为了给您提供更加个性化的服务使用，例如让您拥有更广泛的社交圈的需要而使用、共享或披露。</p>
               <p>f. 让您参与有关魔粉产品和服务的调查，或者促销及抽奖活动；</p>
               <p>g. 经您许可的其他用途。</p>
               <h3>五、知识产权</h3>
               <p>5.1 我们尊重知识产权，除非获得了您的同意，魔粉不会擅自使用、修改、复制、公开传播、改变、散布、发行或公开发表您拥有知识产权的成果。</p>
               <p>5.2 任何组织或个人认为魔粉网站的网页内容，如转载文章、云市场服务商发布的商品信息等可能侵犯其合法权益的，可向魔粉提出通知，魔粉将在收到知识产权权利人合格通知后依法尽快处理。</p>
               <p>5.3 除非另行说明，魔粉网站Logo、“魔粉”、“fan.evtape”等文字、图形及其组合，以及魔粉网站的其他标识、徽记、魔粉服务的名称、技术文档等的知识产权为魔粉及其关联公司所有。</p>
               <p>5.4 您应尊重魔粉和第三方的知识产权和其他合法权利/权益，并保证在发生侵犯前述权益的违法事件时，保护魔粉及其雇员、股东、合作伙伴等免于因该等事件受到影响或损失，魔粉保留在您侵犯魔粉及/或其他第三方的合法权利/权益时终止向您提供服务并不退还任何款项的权利。</p>
               <p>其他具体信息详见《法律声明及隐私权政策》的法律声明部分。</p>

               <h3>六、责任范围和责任限制</h3>
               <p>6.1 您了解并同意，您应承担因您使用本服务、违反本服务条款或在您的账户下采取的任何行动而导致的任何第三方索赔。如果由此引起魔粉及其关联公司、员工、客户和合作伙伴被第三方索赔的，您应负责处理，并赔偿魔粉及其关联公司由此遭受的全部损失和责任。</p>
               <p>6.2 在适用法律许可的范围内，魔粉不对与本服务条款有关或由本服务条款引起的任何间接的、惩罚性的、特殊的、派生的损失承担赔偿责任。</p>
               <p>6.3 您在魔粉平台上发布的内容和信息构成违约的，魔粉可根据相应规则立即对相应内容和信息进行删除、屏蔽等处理或对您的账户进行暂停使用、查封、冻结或注销等处理。</p>
               <p>6.4 魔粉在此提示，您在使用魔粉服务期间应当遵守中华人民共和国的法律，不得危害网络安全，不得利用魔粉的服务从事侵犯他人名誉、隐私、知识产权和其他合法权益的活动。魔粉不对您使用魔粉服务的违法或违约行为承担任何责任。</p>

               <h3>七、不可抗力和意外事件</h3>
               <p>魔粉的网站可能因为下列不可抗力或意外事件无法正常运行的，魔粉不承担损害赔偿责任：</p>
               <p>7.1 因自然灾害、罢工、暴乱、战争、政府行为、司法行政命令等不可抗力因素；</p>
               <p>7.2 因电力供应故障、通讯网络故障等公共服务因素；</p>
               <p>7.3 经提前公告或通知的，魔粉在短时间内的系统维护。</p>

               <h3>八、条款的更新和终止</h3>
               <p>魔粉可根据国家法律法规变化及魔粉平台服务变化的需要，不时修改本协议、补充协议，变更后的协议、补充协议（下称“变更事项”）将通过网页公告、系统消息、短信或邮件的方式通知您。更新后的协议条款一旦公布即代替原来的协议条款。</p>
               <p>如您对变更事项不同意的，您应当于变更事项确定的生效之日起停止使用魔粉平台服务；如您在变更事项生效后仍继续使用魔粉平台服务，则视为您同意已生效的变更事项。</p>

               <h3>九、协议的终止</h3>
               <p>9.1 您有权通过以下任一方式终止本协议：</p>
               <p>a. 在满足魔粉平台网站公示的账户注销等清理条件时您通过网站注销您的账户的；</p>
               <p>b. 变更事项生效前您停止使用并明示不愿接受变更事项的；</p>
               <p>c. 您明示不愿继续使用魔粉平台服务，且符合魔粉平台终止条件的。</p>
               <p>9.2 出现以下情况时，魔粉可以通过网页公告、系统消息、短信或邮件的方式通知您中止或终止本协议：</p>
               <p>a. 您违反本协议约定，魔粉依据违约条款终止本协议的；</p>
               <p>b. 您转让本人账户、盗用他人账户、提供虚假注册身份信息、发布违禁内容和信息、骗取他人财物、采取不正当手段谋利等行为，依据魔粉平台规则对您的账户予以查封的；</p>
               <p>c. 除上述情形外，因您多次违反魔粉平台规则相关规定且情节严重，依据魔粉平台规则对您的账户予以查封的；</p>
               <p>d. 您的账户被魔粉依据本协议进行注销等清理的；</p>
               <p>e. 您在魔粉平台有侵犯他人合法权益或其他严重违法违约行为的；</p>
               <p>f. 其它根据相关法律法规魔粉应当终止服务的情况。</p>

               <h3>十、免责声明</h3>
               <p>10.1 魔粉平台所提供的功能仅供测试和研究使用，用户使用魔粉平台的功能获取非法利益的情况下，应由用户自行负责，与魔粉无关。</p>
               <p>10.2 由于互联网服务的特殊性，用户授权第三方访问/使用其魔粉的内容所导致的纠纷或损失，应由用户自行负责，与魔粉无关。</p>
               <p>10.3 魔粉有权根据法律法规的规定及相关主管部门的要求、第三方权利人的投诉举报，随时变更、中断或终止部分或全部服务。</p>
            </div>
            <button type="button" @click="checked = true;agreementModal = false">同意并继续</button>
         </div>
      </Modal>
  </div>
</template>
<script>
import validate from "@/utils/validate";
import {register, getCode} from '@/api/api';

export default {
    data: function() {
        return {
            phone: '',
            username: '',
            verification: '',
            inviter: '',
            disabled: false,
            btnStr: '获取验证码',
            checked: false,
            agreementModal: false
        };
    },
    methods: {
        // 获取验证码
        getVerificationCode: async function() {
            let self = this;
            let phone = this.phone;
            let data = {};

            // 手机号码验证
            let validatorJson = [
                {
                    name: "phone",
                    label: "手机号码",
                    rules: ['required', 'phoneNumber']
                }
            ];
            if(!validate(validatorJson)){
                return;
            }

            data = {
                phone: phone,
                type: 1
            };
            let res = await getCode(data);
            let message = res.meta.message;
            if (res.meta.code !== 0) {
                this.$Message.error(message);
            } else {
               this.$Message.success(message);
               //倒计时
               let count = 120;
               let timer;
               let self = this;
               (function countDown() {
                  if (count >= 0) {
                     self.btnStr = "重新发送 " + count;
                     count--;
                     self.disabled = true;
                     timer = setTimeout(countDown, 1000);
                  } else {
                     clearTimeout(timer);
                     self.btnStr = "重新发送";
                     self.disabled = false;
                  }
               })();
            }
        },
        // 注册
        doRegist: async function () {
            // 验证
            let validatorJson = [
                {
                    name: 'username',
                    label: '昵称',
                    rules: ['required', 'userName']
                },
                {
                    name: "phone",
                    label: "手机号码",
                    rules: ['required', 'phoneNumber']
                },
                {
                    name: 'verification',
                    label: '验证码',
                    rules: ['required', 'verification']
                },
                {
                    name: 'inviter',
                    label: '邀请人',
                    rules: ['required']
                }
            ];
            if(!validate(validatorJson)){
                return;
            }
            if(!this.checked){
               this.$Message.warning('请先阅读注册协议');
               return;
            }
            let data = {
                phone: this.phone,
                username: this.username,
                verification: this.verification,
                inviter: this.inviter
            }
            let res = await register(data);
            if(res.meta.code === 0){
                this.$Message.success('注册成功');
                setTimeout( () => {
                    this.$router.push({'name': 'login'});
                }, 2000);
                return;
            }
            this.$Message.error(res.meta.message);
        }
    }
};
</script>